MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_hcd.c
  * @brief   HCD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          features of the USB Peripheral Controller:
  *           + Initialization and deinitialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (USB_DRD_FS)
#if defined (USE_HAL_HCD_MODULE) && (USE_HAL_HCD_MODULE == 1)

/** @addtogroup HCD
  * @brief Host Controller Driver, including the functions that allow the USB to be used in host mode.
  * @{
  */
/** @defgroup HCD_Introduction Introduction
  * @{

  USB Host Controller Driver (HCD) hardware abstraction layer provides all required APIs to interface with the
  USB peripheral in host mode. It simplifies the initialization, configuration, and management of the USB depending
  on the user's required host function.

  This abstraction layer ensures portability and ease of use across different STM32 series.
  The HCD HAL abstracts different USB hardware instances that can be present (depending on the STM32 MCU):
  * USB OTG FS (On-The-GO Full Speed)
  * USB OTG HS (On-The-GO High Speed)
  * USB DRD FS (Dual Role Device Full Speed)

  */
/**
  * @}
  */

/** @defgroup HCD_How_To_Use How To Use
  * @{
  # How to use the HAL USB HCD module driver

  ## Use the USB Host Controller Driver (HCD) HAL driver as follows:

  1. Declare a hal_hcd_handle_t handle structure, for example:
      hal_hcd_handle_t gh_hcd_usb_drd_fs;

  2. Initialize the USB HCD low-level resources:
    - USB HCD interface clock configuration:
      - Enable USB peripheral clock.

    - USB HCD interface Power configuration:
      - Enable USB peripheral VddUSB power supply if applicable.

    - USB host pins configuration:
      USB data pins are automatically configured by the hardware during USB peripheral initialization;
      no additional user action is required.

    - NVIC configuration for interrupt handling with HAL_HCD_IRQHandler():
      - Set the USB HCD interrupt priority.
      - Enable the USB IRQ channel in the NVIC.

  3. Initialize the USB HCD driver with HAL_HCD_Init() by selecting an instance, for example:

     - HAL_HCD_Init(&gh_hcd_usb_drd_fs, HAL_HCD_DRD_FS);

  - Declare a hal_hcd_config_t structure, for example:
     - hal_hcd_config_t config_hcd_usb_drd_fs;

  - In the configuration structure,
    program the PHY interface, core speed, and other parameters as required.

  - Apply the configuration with:
     - HAL_HCD_SetConfig(&gh_hcd_usb_drd_fs, &config_hcd_usb_drd_fs);

  ## USB HCD callback definitions:
  By default, all callbacks are initialized to their corresponding default weak functions.
  When the compilation define USE_HAL_HCD_REGISTER_CALLBACKS is set to 1U, configure the
  driver callbacks dynamically using the callback registration functions:

  | Default callback weak function                   | Callback registration function
  |--------------------------------------------------|------------------------------------------------------------------
  | HAL_HCD_SofCallback()                            | HAL_HCD_RegisterSofCallback()
  | HAL_HCD_PortConnectCallback()                    | HAL_HCD_RegisterPortConnectCallback()
  | HAL_HCD_PortDisconnectCallback()                 | HAL_HCD_RegisterPortDisconnectCallback()
  | HAL_HCD_PortEnabledCallback()                    | HAL_HCD_RegisterPortEnabledCallback()
  | HAL_HCD_PortDisabledCallback()                   | HAL_HCD_RegisterPortDisabledCallback()
  | HAL_HCD_PortSuspendCallback()                    | HAL_HCD_RegisterPortSuspendCallback()
  | HAL_HCD_PortResumeCallback()                     | HAL_HCD_RegisterPortResumeCallback()
  | HAL_HCD_ChannelNotifyURBChangeCallback()         | HAL_HCD_RegisterChannelNotifyURBChangeCallback()
  | HAL_HCD_ChannelAbortTransferCallback()           | HAL_HCD_RegisterChannelAbortTransferCallback()
  | HAL_HCD_ErrorCallback()                          | HAL_HCD_RegisterErrorCallback()
  */

/**
  * @}
  */

/** @defgroup HCD_Configuration_Table Configuration Table
  * @{
  ## Configuration inside the USB HCD driver:

  | Config defines                 | Description     | Default value | Note
  |--------------------------------|-----------------|---------------|--------------------------------------------------
  | USE_ASSERT_DBG_PARAM           | from IDE        |       NA      | Enable the parameter assert.
  | USE_ASSERT_DBG_STATE           | from IDE        |       NA      | Enable the state assert.
  | USE_HAL_HCD_MODULE             | from hal_conf.h |        1      | Enable the HAL USB HCD module.
  | USE_HAL_HCD_REGISTER_CALLBACKS | from hal_conf.h |        0      | Enable the register callbacks.
  | USE_HAL_HCD_MAX_CHANNEL_NB     | from hal_conf.h |       16      | Maximum number of USB HCD channels.
  | USE_HAL_HCD_USB_EP_TYPE_ISOC   | from hal_conf.h |        1      | Enable support for isochronous endpoints.
  | USE_HAL_HCD_USB_DOUBLE_BUFFER  | from hal_conf.h |        1      | Enable double-buffering for USB transfers.
  | USE_HAL_HCD_USER_DATA          | from hal_conf.h |        0      | Add user data to the HAL USB HCD handle.
  | USE_HAL_HCD_GET_LAST_ERRORS    | from hal_conf.h |        0      | Add an error value to the HAL USB HCD handle.
  | USE_HAL_CHECK_PARAM            | from hal_conf.h |        0      | Enable checking of HCD API parameters at runtime.
  */

/**
  * @}
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/** @defgroup HCD_Private_Macros Private Macros
  * @{
  */

/*! Macro to check ep_type */
#define HAL_HCD_CHECK_EP_TYPE(ep_type) ((((ep_type) == HAL_HCD_EP_TYPE_CTRL) \
                                         || ((ep_type) == HAL_HCD_EP_TYPE_BULK) \
                                         || ((ep_type) == HAL_HCD_EP_TYPE_INTR) \
                                         || ((ep_type) == HAL_HCD_EP_TYPE_ISOC)) ? 1U : 0U)

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup HCD_Private_Functions Private Functions
  * @{
  */

static void HCD_DRD_CHANNEL_IN_IRQHandler(hal_hcd_handle_t *hhcd, usb_core_phy_chep_t phy_ch_num);
static void HCD_DRD_CHANNEL_OUT_IRQHandler(hal_hcd_handle_t *hhcd, usb_core_phy_chep_t phy_ch_num);
static void HCD_DRD_Port_IRQHandler(hal_hcd_handle_t *hhcd);

#if defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1)
static void HCD_DRD_CHANNEL_IN_BulkDb(hal_hcd_handle_t *hhcd, usb_core_channel_t ch_num,
                                      usb_core_phy_chep_t phy_ch_num, uint32_t reg_value);

static void HCD_DRD_CHANNEL_OUT_BulkDb(hal_hcd_handle_t *hhcd, usb_core_channel_t ch_num,
                                       usb_core_phy_chep_t phy_ch_num, uint32_t reg_value);

#endif /* defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1) */
#if defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1)
static void HCD_DRD_CHANNEL_IN_IsocDb(hal_hcd_handle_t *hhcd, usb_core_channel_t ch_num,
                                      usb_core_phy_chep_t phy_ch_num, uint32_t reg_value);
#endif /* defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1) */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup HCD_Exported_Functions Exported Functions
  * @{
  */

