MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
/** @addtogroup HCD_Exported_Functions_Group1 Initialization and deinitialization functions
  *
  * @{
  This subsection provides a set of functions allowing to initialize and deinitialize the HCD.
  - Call the function HAL_HCD_Init() to initialize the selected HCD handle and associate an instance.
  - Call the function HAL_HCD_DeInit() to de-initialize the given HAL HCD instance by resetting the state machine.
  */

/**
  * @brief  Initialize the host driver.
  * @param  hhcd HCD handle
  * @param  instance HCD instance
  * @retval HAL status
  */
hal_status_t HAL_HCD_Init(hal_hcd_handle_t *hhcd, hal_hcd_t instance)
{
  uint32_t ch_idx;

  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(IS_HCD_ALL_INSTANCE((usb_drd_global_t *)((uint32_t)instance)));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hhcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }

  if (!IS_HCD_ALL_INSTANCE((usb_drd_global_t *)((uint32_t)instance)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->instance = instance;

  switch (instance)
  {
    case HAL_HCD_DRD_FS:

      /* Register USB core instance operational functions */
      (void)USB_DRD_HCD_InitDriver(&hhcd->driver);

      hhcd->p_irq_handler = HAL_HCD_DRD_IRQHandler;

      hhcd->host_channels_nbr = (uint8_t)(USB_DRD_FS_CH_NBR);
      break;

    default:
      break;
  }

#if defined (USE_HAL_HCD_GET_LAST_ERRORS) && (USE_HAL_HCD_GET_LAST_ERRORS == 1)
  hhcd->last_error_codes = HAL_HCD_ERROR_NONE;
#endif /* USE_HAL_HCD_GET_LAST_ERRORS */

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
  hhcd->p_sof_cb = HAL_HCD_SofCallback;
  hhcd->p_port_connect_cb = HAL_HCD_PortConnectCallback;
  hhcd->p_port_disconnect_cb = HAL_HCD_PortDisconnectCallback;
  hhcd->p_port_enable_cb = HAL_HCD_PortEnabledCallback;
  hhcd->p_port_disable_cb = HAL_HCD_PortDisabledCallback;
  hhcd->p_port_suspend_cb = HAL_HCD_PortSuspendCallback;
  hhcd->p_port_resume_cb = HAL_HCD_PortResumeCallback;
  hhcd->p_ch_notify_urb_change_cb = HAL_HCD_ChannelNotifyURBChangeCallback;
  hhcd->p_ch_abort_transfer_cb = HAL_HCD_ChannelAbortTransferCallback;
  hhcd->p_error_cb = HAL_HCD_ErrorCallback;
#endif /* (USE_HAL_HCD_REGISTER_CALLBACKS) */

#if defined (USE_HAL_HCD_USER_DATA) && (USE_HAL_HCD_USER_DATA == 1U)
  hhcd->p_user_data = (void *)NULL;
#endif /* USE_HAL_HCD_USER_DATA */

  for (ch_idx = 0U; ch_idx < HCD_MIN(hhcd->host_channels_nbr, USE_HAL_HCD_MAX_CHANNEL_NB); ch_idx++)
  {
    hhcd->channel[ch_idx].state = HAL_HCD_CHANNEL_STATE_RESET;
    hhcd->channel[ch_idx].urb_state = HAL_HCD_CHANNEL_URB_STATE_RESET;
  }

  hhcd->port_state = HAL_HCD_PORT_STATE_DEV_DISCONNECT;
  hhcd->global_state = HAL_HCD_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  DeInitialize the host driver.
  * @param  hhcd HCD handle
  */
void HAL_HCD_DeInit(hal_hcd_handle_t *hhcd)
{
  uint32_t ch_idx;

  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(IS_HCD_ALL_INSTANCE((usb_drd_global_t *)((uint32_t)hhcd->instance)));

  /* Prevent interrupts during deinitialization */
  (void)hhcd->driver.core_disable_interrupts((uint32_t)hhcd->instance);

  (void)hhcd->driver.core_deinit((uint32_t)hhcd->instance);

#if defined (USE_HAL_HCD_USER_DATA) && (USE_HAL_HCD_USER_DATA == 1U)
  hhcd->p_user_data = (void *) NULL;
#endif /* USE_HAL_HCD_USER_DATA */

#if defined (USE_HAL_HCD_GET_LAST_ERRORS) && (USE_HAL_HCD_GET_LAST_ERRORS == 1)
  hhcd->last_error_codes = HAL_HCD_ERROR_NONE;
#endif /* USE_HAL_HCD_GET_LAST_ERRORS */

  for (ch_idx = 0U; ch_idx < HCD_MIN(hhcd->host_channels_nbr, USE_HAL_HCD_MAX_CHANNEL_NB); ch_idx++)
  {
    hhcd->channel[ch_idx].state = HAL_HCD_CHANNEL_STATE_RESET;
    hhcd->channel[ch_idx].urb_state = HAL_HCD_CHANNEL_URB_STATE_RESET;
  }

  hhcd->port_state = HAL_HCD_PORT_STATE_DEV_DISCONNECT;
  hhcd->global_state = HAL_HCD_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup HCD_Exported_Functions_Group2 Global Configuration functions
  * @{
  This subsection provides functions allowing to configure the USB in Host mode:
  - Call HAL_HCD_SetConfig() to configure the initialized instance with a set of parameters containing:
     * phy_interface
     * channels_nbr
     * core_speed
     * bulk_db_state
     * iso_db_state
  */

/**
  * @brief  Configure the HCD according to the specified
  *         parameters in the hal_hcd_handle_t and initialize the associated handle.
  * @param  hhcd HCD handle
  * @param  p_config pointer to the peripheral configuration structure
  * @retval HAL status
  */
hal_status_t HAL_HCD_SetConfig(hal_hcd_handle_t *hhcd, const hal_hcd_config_t *p_config)
{
  hal_status_t ret = HAL_OK;
  usb_core_config_params_t usb_core_config = {0U};

  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_config == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_INIT);

  switch (hhcd->instance)
  {
    case HAL_HCD_DRD_FS:

      usb_core_config.phy_interface = (usb_core_phy_module_t)p_config->phy_interface;
      usb_core_config.channels_nbr = hhcd->host_channels_nbr;
      usb_core_config.core_speed = (usb_core_speed_t)p_config->hcd_speed;
      usb_core_config.bulk_db_state = (usb_core_config_status_t)p_config->bulk_doublebuffer_enable;
#if defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1)
      usb_core_config.iso_db_state = (usb_core_config_status_t)p_config->iso_doublebuffer_enable;
#endif /* defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1) */
      break;

    default:
      break;
  }

  /* Prevent interrupts during host core configuration */
  (void)hhcd->driver.core_disable_interrupts((uint32_t)hhcd->instance);

  /* Initialize the USB core */
  if (hhcd->driver.core_init((uint32_t)hhcd->instance, &usb_core_config) != USB_CORE_OK)
  {
    hhcd->global_state = HAL_HCD_STATE_FAULT;
    return HAL_ERROR;
  }

