MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
  /* Switch the USB core to host mode */
  if (hhcd->driver.core_set_mode((uint32_t)hhcd->instance, USB_CORE_HOST_MODE) != USB_CORE_OK)
  {
    hhcd->global_state = HAL_HCD_STATE_FAULT;
    ret = HAL_ERROR;
  }

  /* Initialize host-specific registers and configuration */
  if (hhcd->driver.host_init((uint32_t)hhcd->instance, &usb_core_config) != USB_CORE_OK)
  {
    hhcd->global_state = HAL_HCD_STATE_FAULT;
    ret = HAL_ERROR;
  }

  hhcd->port_state = HAL_HCD_PORT_STATE_DEV_DISCONNECT;

  if (ret != HAL_ERROR)
  {
    hhcd->global_state = HAL_HCD_STATE_IDLE;
  }

  return ret;
}

/**
  * @}
  */

/** @addtogroup HCD_Exported_Functions_Group3 User Data functions
  * @{
  */
#if defined (USE_HAL_HCD_GET_LAST_ERRORS) && (USE_HAL_HCD_GET_LAST_ERRORS == 1)
/**
  * @brief Get Last Error codes.
  * @param hhcd Pointer to a hal_hcd_handle_t
  * @retval last error code.
  */
uint32_t HAL_HCD_GetLastErrorCodes(const hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

  return (hhcd->last_error_codes);
}
#endif /* USE_HAL_HCD_GET_LAST_ERRORS */

#if defined (USE_HAL_HCD_USER_DATA) && (USE_HAL_HCD_USER_DATA == 1)

/**
  * @brief Set the user data pointer into the handle.
  * @param hhcd Pointer to a hal_hcd_handle_t
  * @param p_user_data Pointer to the user data.
  */
void HAL_HCD_SetUserData(hal_hcd_handle_t *hhcd, const void *p_user_data)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

  hhcd->p_user_data = p_user_data;
}

/**
  * @brief Get the user data pointer from the handle.
  * @param hhcd Pointer to a hal_hcd_handle_t
  * @retval Pointer to the user data.
  */
const void *HAL_HCD_GetUserData(const hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

  return (hhcd->p_user_data);
}

#endif /* USE_HAL_HCD_USER_DATA */
/**
  * @}
  */

/** @defgroup HCD_Exported_Functions_Group4 Peripheral Control functions
  * @{
  */
/**
  * @brief  Start the host driver.
  * @param  hhcd HCD handle
  * @retval HAL status
  */
hal_status_t HAL_HCD_Start(hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hhcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_IDLE);
  HAL_CHECK_UPDATE_STATE(hhcd, global_state, HAL_HCD_STATE_IDLE, HAL_HCD_STATE_ACTIVE);

  /* Enable port power and start device connection detection */
  (void)hhcd->driver.host_start((uint32_t)hhcd->instance);

  return HAL_OK;
}

/**
  * @brief  Stop the host driver.
  * @param  hhcd HCD handle
  * @retval HAL status
  */
hal_status_t HAL_HCD_Stop(hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hhcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE | HAL_HCD_STATE_IDLE);

  (void)hhcd->driver.host_stop((uint32_t)hhcd->instance);

  hhcd->global_state = HAL_HCD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Reset the host port.
  * @param  hhcd HCD handle
  * @retval HAL status
  */
hal_status_t HAL_HCD_ResetPort(hal_hcd_handle_t *hhcd)
{
  uint32_t wait_start;

  ASSERT_DBG_PARAM((hhcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hhcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->port_state, (hal_hcd_port_state_t)((uint32_t)HAL_HCD_PORT_STATE_DEV_CONNECT
                                                            | (uint32_t)HAL_HCD_PORT_STATE_DEV_RESET
                                                            | (uint32_t)HAL_HCD_PORT_STATE_DEV_RUN
                                                            | (uint32_t)HAL_HCD_PORT_STATE_DEV_SUSPEND
                                                            | (uint32_t)HAL_HCD_PORT_STATE_DEV_RESUME));

  /* Reset the USB Port by inserting an SE0 on the bus */
  (void)hhcd->driver.host_port_reset((uint32_t)hhcd->instance, USB_CORE_PORT_RESET_STS_SET);

  /* Wait for USB reset duration */
  wait_start = HAL_GetTick();
  while ((HAL_GetTick() - wait_start) < 100U)
  {
  }

  (void)hhcd->driver.host_port_reset((uint32_t)hhcd->instance, USB_CORE_PORT_RESET_STS_CLEAR);

  /* Wait for reset recovery time */
  wait_start = HAL_GetTick();
  while ((HAL_GetTick() - wait_start) < 30U)
  {
  }

  hhcd->port_state = HAL_HCD_PORT_STATE_DEV_RESET;

  return HAL_OK;
}

/**
  * @brief  Put the Device in suspend mode.
  * @param  hhcd HCD handle
  * @retval HAL status
  */
hal_status_t HAL_HCD_SuspendPort(hal_hcd_handle_t *hhcd)
{
  hal_status_t ret = HAL_OK;

  ASSERT_DBG_PARAM((hhcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hhcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->port_state, HAL_HCD_PORT_STATE_DEV_RUN);

  if (hhcd->driver.host_port_suspend((uint32_t)hhcd->instance) != USB_CORE_OK)
  {
    ret = HAL_ERROR;
  }
  else
  {
    HAL_CHECK_UPDATE_STATE(hhcd, port_state, HAL_HCD_PORT_STATE_DEV_RUN, HAL_HCD_PORT_STATE_DEV_SUSPEND);
  }

  return ret;
}

/**
  * @brief  Resume the host port.
  * @param  hhcd HCD handle
  * @retval HAL status
  */
hal_status_t HAL_HCD_ResumePort(hal_hcd_handle_t *hhcd)
{
  uint32_t wait_start;

  ASSERT_DBG_PARAM((hhcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hhcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->port_state, HAL_HCD_PORT_STATE_DEV_SUSPEND);

  (void)hhcd->driver.host_port_resume((uint32_t)hhcd->instance, USB_CORE_PORT_RESUME_STS_SET);

  /* Wait for resume signaling duration */
  wait_start = HAL_GetTick();
  while ((HAL_GetTick() - wait_start) < 30U)
  {
  }

  (void)hhcd->driver.host_port_resume((uint32_t)hhcd->instance, USB_CORE_PORT_RESUME_STS_CLEAR);

  HAL_CHECK_UPDATE_STATE(hhcd, port_state, HAL_HCD_PORT_STATE_DEV_SUSPEND, HAL_HCD_PORT_STATE_DEV_RESUME);

  return HAL_OK;
}

/**
  * @brief  Return the current Host frame number.
  * @param  hhcd HCD handle
  * @retval Current Host frame number
  */
uint32_t HAL_HCD_GetCurrentFrame(const hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->port_state, HAL_HCD_PORT_STATE_DEV_RUN);

  return (hhcd->driver.host_get_current_frame((uint32_t)hhcd->instance));
}

/**
  * @brief  Return the Host enumeration speed.
  * @param  hhcd HCD handle
  * @retval Enumeration speed
  */
hal_hcd_port_speed_t HAL_HCD_GetPortSpeed(const hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->port_state, HAL_HCD_PORT_STATE_DEV_RUN);

  return (hal_hcd_port_speed_t)hhcd->driver.host_get_port_speed((uint32_t)hhcd->instance);
}

/**
  * @brief  Return the HCD DMA status enabled or disabled.
  * @param  hhcd HCD handle
  * @retval state
  */
hal_hcd_dma_status_t HAL_HCD_IsEnabledDMA(const hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

  return (hal_hcd_dma_status_t)(hhcd->driver.core_get_dma_status((uint32_t)hhcd->instance));
}

/**
  * @brief  Return the last host transfer size.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval last transfer size in byte
  */
uint32_t HAL_HCD_GetChannelTransferCount(const hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));
  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->port_state, HAL_HCD_PORT_STATE_DEV_RUN);
  ASSERT_DBG_STATE(hhcd->channel[ch_num].state,
                   (hal_hcd_channel_state_t)((uint32_t)HAL_HCD_CHANNEL_STATE_HALTED
                                             | (uint32_t)HAL_HCD_CHANNEL_STATE_XFRC));

  return hhcd->channel[ch_num].core_ch.xfer_count;
}

/**
  * @brief  Halt a host channel.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval HAL status
  */
hal_status_t HAL_HCD_HaltChannel(const hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

