MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);

  hhcd->driver.host_channel_halt((uint32_t)hhcd->instance, &hhcd->channel[ch_num].core_ch);

  return status;
}

/**
  * @brief  Initialize a host channel.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  p_channel_config channel config structure
  * @retval HAL status
  */
hal_status_t HAL_HCD_SetConfigChannel(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num,
                                      const hal_hcd_channel_config_t *p_channel_config)
{
  uint8_t ep_num;

  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_channel_config != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));
  ASSERT_DBG_PARAM((HAL_HCD_CHECK_EP_TYPE(p_channel_config->ep_type) != 0U));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_channel_config == NULL)
      || ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB)
      || (HAL_HCD_CHECK_EP_TYPE(p_channel_config->ep_type) == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);

  ep_num = p_channel_config->ep_address & 0xFU;
  hhcd->channel[ch_num].core_ch.dev_addr = p_channel_config->device_address;
  hhcd->channel[ch_num].core_ch.ch_num = (usb_core_channel_t)ch_num;
  hhcd->channel[ch_num].core_ch.ep_type = (usb_core_ep_type_t)p_channel_config->ep_type;
  hhcd->channel[ch_num].core_ch.ep_num = (usb_core_endpoint_t)ep_num;

  (void)HAL_HCD_ClearChannelHubInfo(hhcd, ch_num);

  if ((p_channel_config->ep_address & USB_CORE_IN_EP_DIR_MSK) == USB_CORE_IN_EP_DIR_MSK)
  {
    hhcd->channel[ch_num].core_ch.ch_dir = USB_CORE_CH_IN_DIR;
  }
  else
  {
    hhcd->channel[ch_num].core_ch.ch_dir = USB_CORE_CH_OUT_DIR;
  }

  hhcd->channel[ch_num].core_ch.speed = (usb_core_device_speed_t)p_channel_config->device_speed;
  hhcd->channel[ch_num].core_ch.max_packet = p_channel_config->ep_mps;
  hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_IDLE;

  if (hhcd->driver.host_channel_init((uint32_t)hhcd->instance, &hhcd->channel[ch_num].core_ch) != USB_CORE_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Submit a new URB (USB Request Block) transfer request for processing.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  p_channel_transfer_req Channel transfer request.
  * @retval HAL status
  */
hal_status_t HAL_HCD_RequestChannelTransfer(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num,
                                            const hal_hcd_channel_transfer_req_t *p_channel_transfer_req)
{
  hal_status_t ret = HAL_OK;

  ASSERT_DBG_PARAM(hhcd != NULL);
  ASSERT_DBG_PARAM(p_channel_transfer_req != NULL);
  ASSERT_DBG_PARAM((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_channel_transfer_req == NULL) || ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);
  ASSERT_DBG_STATE(hhcd->channel[ch_num].state,
                   (hal_hcd_channel_state_t)((uint32_t)HAL_HCD_CHANNEL_STATE_IDLE
                                             | (uint32_t)HAL_HCD_CHANNEL_STATE_XFRC
                                             | (uint32_t)HAL_HCD_CHANNEL_STATE_HALTED
                                             | (uint32_t)HAL_HCD_CHANNEL_STATE_NAK
                                             | (uint32_t)HAL_HCD_CHANNEL_STATE_STALL
                                             | (uint32_t)HAL_HCD_CHANNEL_STATE_XACTERR));

  if (p_channel_transfer_req->token_type == 0U)
  {
    hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_SETUP;
  }
  else
  {
    hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA1;
  }

  /* Manage Data Toggle */
  switch (p_channel_transfer_req->ep_type)
  {
    case HAL_HCD_EP_TYPE_CTRL:
      if (p_channel_transfer_req->token_type == 1U) /* send data */
      {
        if (p_channel_transfer_req->ch_dir == HAL_HCD_CH_OUT_DIR)
        {
          if (p_channel_transfer_req->transfer_length == 0U)
          {
            /* For Status OUT stage, Length == 0U, Status Out PID = 1 */
            hhcd->channel[ch_num].toggle_out = 1U;
          }

          if (hhcd->channel[ch_num].toggle_out == 0U)
          {
            hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA0;
          }
          else
          {
            hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA1;
          }
        }
      }
      break;

    case HAL_HCD_EP_TYPE_BULK:
      if (p_channel_transfer_req->ch_dir == HAL_HCD_CH_OUT_DIR)
      {
        if (hhcd->channel[ch_num].toggle_out == 0U)
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA0;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA1;
        }
      }
      else
      {
        if (hhcd->channel[ch_num].toggle_in == 0U)
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA0;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA1;
        }
      }

      break;
    case HAL_HCD_EP_TYPE_INTR:
      if (p_channel_transfer_req->ch_dir == HAL_HCD_CH_OUT_DIR)
      {
        if (hhcd->channel[ch_num].toggle_out == 0U)
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA0;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA1;
        }
      }
      else
      {
        if (hhcd->channel[ch_num].toggle_in == 0U)
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA0;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA1;
        }
      }
      break;
#if defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1)
    case HAL_HCD_EP_TYPE_ISOC:
      hhcd->channel[ch_num].core_ch.data_pid = USB_CORE_CH_PID_DATA0;
      break;
#endif /* defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1) */
    default:
      return HAL_ERROR;
      break;
  }

