MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
  hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_IDLE;
  hhcd->channel[ch_num].core_ch.p_xfer_buffer = p_channel_transfer_req->p_buffer;
  hhcd->channel[ch_num].core_ch.xfer_length = p_channel_transfer_req->transfer_length;
  hhcd->channel[ch_num].core_ch.xfer_size = p_channel_transfer_req->transfer_length;
  hhcd->channel[ch_num].core_ch.ch_dir = (usb_core_ch_direction_t)p_channel_transfer_req->ch_dir;
  hhcd->channel[ch_num].core_ch.ep_type = (usb_core_ep_type_t)p_channel_transfer_req->ep_type;
  hhcd->channel[ch_num].core_ch.xfer_count = 0U;
  hhcd->channel[ch_num].core_ch.ch_num = (usb_core_channel_t)ch_num;
  hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFR;

  (void)hhcd->driver.host_channel_start((uint32_t)hhcd->instance, &hhcd->channel[ch_num].core_ch);

  return ret;
}

/**
  * @brief  Set host channel hub information.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  hub_addr Hub address
  * @param  port_nbr Hub port number
  * @retval HAL status
  */
hal_status_t HAL_HCD_SetChannelHubInfo(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num,
                                       uint8_t hub_addr, uint8_t port_nbr)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);


  hhcd->channel[ch_num].core_ch.hub_addr = hub_addr;
  hhcd->channel[ch_num].core_ch.hub_port_nbr = port_nbr;

  return HAL_OK;
}

/**
  * @brief  Clear host channel hub information.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval HAL status
  */
hal_status_t HAL_HCD_ClearChannelHubInfo(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);

  hhcd->channel[ch_num].core_ch.hub_addr = 0U;
  hhcd->channel[ch_num].core_ch.hub_port_nbr = 0U;

  return HAL_OK;
}


/**
  * @brief  Close host channel.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval HAL status
  */
hal_status_t HAL_HCD_CloseChannel(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hhcd->global_state, HAL_HCD_STATE_ACTIVE);

  if (hhcd->driver.host_channel_close((uint32_t)hhcd->instance, &hhcd->channel[ch_num].core_ch) != USB_CORE_OK)
  {
    return HAL_ERROR;
  }

  hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_HALTED;

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
  hhcd->p_ch_abort_transfer_cb(hhcd, ch_num);
#else
  HAL_HCD_ChannelAbortTransferCallback(hhcd, ch_num);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

  return HAL_OK;
}


/**
  * @}
  */

/** @defgroup HCD_Exported_Functions_Group5 Peripheral State functions
  * @{
  */

/**
  * @brief  Return the HCD handle state.
  * @param  hhcd HCD handle
  * @retval HAL state
  */
hal_hcd_state_t HAL_HCD_GetState(const hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));

  return hhcd->global_state;
}

/**
  * @brief  Return  URB (USB Request Block) state for a channel.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval URB state.
  *          This parameter can be one of these values:
  *            HAL_HCD_CHANNEL_URB_STATE_IDLE
  *            HAL_HCD_CHANNEL_URB_STATE_DONE
  *            HAL_HCD_CHANNEL_URB_STATE_NOTREADY
  *            HAL_HCD_CHANNEL_URB_STATE_ERROR
  *            HAL_HCD_CHANNEL_URB_STATE_STALL
  */
hal_hcd_channel_urb_state_t HAL_HCD_GetChannelURBState(const hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

  return hhcd->channel[ch_num].urb_state;
}

/**
  * @brief  Return the Host Channel state.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 0 to 15
  * @retval Host channel state
  *          This parameter can be one of these values:
  *            HAL_HCD_CHANNEL_STATE_RESET
  *            HAL_HCD_CHANNEL_STATE_IDLE
  *            HAL_HCD_CHANNEL_STATE_XFRC
  *            HAL_HCD_CHANNEL_STATE_HALTED
  *            HAL_HCD_CHANNEL_STATE_NAK
  *            HAL_HCD_CHANNEL_STATE_STALL
  *            HAL_HCD_CHANNEL_STATE_XFR
  *            HAL_HCD_CHANNEL_STATE_XACTERR
  */
hal_hcd_channel_state_t HAL_HCD_GetChannelState(const hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

  return hhcd->channel[ch_num].state;
}

/**
  * @}
  */

/** @defgroup HCD_Exported_Functions_Group6 IRQ handling functions
  * @{
  */
/**
  * @brief  Handles HCD interrupt request.
  * @param  hhcd HCD handle
  */
void HAL_HCD_IRQHandler(hal_hcd_handle_t *hhcd)
{
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((hhcd->p_irq_handler != NULL));

  hhcd->current_mode = hhcd->driver.core_get_mode((uint32_t)hhcd->instance);

  hhcd->p_irq_handler(hhcd);
}


/**
  * @brief  Handle HCD interrupt request.
  * @param  hhcd HCD handle
  */
void HAL_HCD_DRD_IRQHandler(hal_hcd_handle_t *hhcd)
{
  usb_drd_global_t *p_usb;
  uint32_t istr_reg;
  uint32_t ch_dir;
  uint32_t phy_ch_num;

  ASSERT_DBG_PARAM((hhcd != NULL));

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);
  istr_reg = USB_DRD_ReadInterrupts((uint32_t)p_usb);

  /* Port Change Detected (Connection/Disconnection) */
  if ((istr_reg & USB_ISTR_DCON) == USB_ISTR_DCON)
  {

    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_DCON);

