MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
    HCD_DRD_Port_IRQHandler(hhcd);

    return;
  }

  /* Correct Transaction Detected -------*/
  if ((istr_reg & USB_ISTR_CTR) == USB_ISTR_CTR)
  {
    /* Get Physical channel */
    phy_ch_num = (USB_DRD_GET_CHNUM(p_usb) & 0x7U);

    /* Get channel direction */
    ch_dir = USB_DRD_GET_CHDIR(p_usb);

    if (ch_dir == (uint32_t)USB_CORE_CH_OUT_DIR)
    {
      /* Call Channel_OUT_IRQ() */
      HCD_DRD_CHANNEL_OUT_IRQHandler(hhcd, (usb_core_phy_chep_t)phy_ch_num);
    }
    else
    {
      /* Call Channel_IN_IRQ() */
      HCD_DRD_CHANNEL_IN_IRQHandler(hhcd, (usb_core_phy_chep_t)phy_ch_num);
    }

    return;
  }

  /* Wakeup Flag Detected */
  if ((istr_reg & USB_ISTR_WKUP) == USB_ISTR_WKUP)
  {
    if (hhcd->port_state == HAL_HCD_PORT_STATE_DEV_SUSPEND)
    {
      /* Set The L2Resume bit */
      p_usb->CNTR |= USB_CNTR_L2RES;

      /* Clear the wake-up flag */
      USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_WKUP);

      /* Update the USB Software state machine */
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->p_port_resume_cb(hhcd);
#else
      HAL_HCD_PortResumeCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

      hhcd->port_state = HAL_HCD_PORT_STATE_DEV_RUN;
    }
    else
    {
      /* Clear the wake-up flag */
      USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_WKUP);
    }

    return;
  }

  /* Global Error Flag Detected */
  if ((istr_reg & USB_ISTR_ERR) == USB_ISTR_ERR)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_ERR);

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_error_cb(hhcd);
#else
    HAL_HCD_ErrorCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

    return;
  }

  /* PMA Overrun detected */
  if ((istr_reg & USB_ISTR_PMAOVR) == USB_ISTR_PMAOVR)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_PMAOVR);

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_error_cb(hhcd);
#else
    HAL_HCD_ErrorCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

    return;
  }

  /* USB BUS suspend Detected */
  if ((istr_reg & USB_ISTR_SUSP) == USB_ISTR_SUSP)
  {
    hhcd->port_state = HAL_HCD_PORT_STATE_DEV_SUSPEND;

    /* Force low-power mode in the macrocell */
    p_usb->CNTR |= USB_CNTR_SUSPEN;

    /* Clear the ISTR bit after setting CNTR_FSUSP */
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_SUSP);

    /* Call suspend Callback */
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_port_suspend_cb(hhcd);
#else
    HAL_HCD_PortSuspendCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

    return;
  }

  /* Start Of Frame Detected */
  if ((istr_reg & USB_ISTR_SOF) == USB_ISTR_SOF)
  {
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_sof_cb(hhcd);
#else
    HAL_HCD_SofCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_SOF);

    if (hhcd->port_state == HAL_HCD_PORT_STATE_DEV_RESET)
    {
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->p_port_enable_cb(hhcd);
#else
      HAL_HCD_PortEnabledCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
    }

    hhcd->port_state = HAL_HCD_PORT_STATE_DEV_RUN;

    return;
  }
}

/**
  * @}
  */

/** @defgroup HCD_Exported_Functions_Group7 Default Callbacks functions
  * @{
  */

/**
  * @brief  SOF callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_SofCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_SofCallback could be implemented in the user file
   */
}

/**
  * @brief Connection Event callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_PortConnectCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_PortConnectCallback could be implemented in the user file
   */
}

/**
  * @brief  Disconnection Event callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_PortDisconnectCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_PortDisconnectCallback could be implemented in the user file
   */
}

/**
  * @brief  Port Enabled  Event callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_PortEnabledCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_PortEnabledCallback could be implemented in the user file
   */
}

/**
  * @brief  Port Disabled  Event callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_PortDisabledCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_PortDisabledCallback could be implemented in the user file
   */
}

/**
  * @brief  Suspend Event callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_PortSuspendCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_PortSuspendCallback could be implemented in the user file
  */

}

/**
  * @brief  Resume Event callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_PortResumeCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_PortResumeCallback could be implemented in the user file
  */
}

/**
  * @brief  Notify URB (USB Request Block) state change callback.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  urb_state:
  *          This parameter can be one of these values:
  *            HAL_HCD_CHANNEL_URB_STATE_IDLE/
  *            HAL_HCD_CHANNEL_URB_STATE_DONE/
  *            HAL_HCD_CHANNEL_URB_STATE_NOTREADY/
  *            HAL_HCD_CHANNEL_URB_STATE_ERROR/
  *            HAL_HCD_CHANNEL_URB_STATE_STALL/
  */
__WEAK void HAL_HCD_ChannelNotifyURBChangeCallback(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num,
                                                   hal_hcd_channel_urb_state_t urb_state)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);
  STM32_UNUSED(ch_num);
  STM32_UNUSED(urb_state);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_ChannelNotifyURBChangeCallback could be implemented in the user file
   */
}

/**
  * @brief  HCD Error callback.
  * @param  hhcd HCD handle
  */
__WEAK void HAL_HCD_ErrorCallback(hal_hcd_handle_t *hhcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_ErrorCallback could be implemented in the user file
   */
}

/**
  * @brief  HCD Abort Transfer callback.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  */
__WEAK void HAL_HCD_ChannelAbortTransferCallback(hal_hcd_handle_t *hhcd, hal_hcd_channel_t ch_num)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhcd);
  STM32_UNUSED(ch_num);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_HCD_ChannelAbortTransferCallback could be implemented in the user file
   */
}

/**
  * @}
  */

