MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
/** @defgroup HCD_Exported_Functions_Group8 Register Callbacks functions
  * @{
  */
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register User SOF Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterSofCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_sof_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB HCD Connect Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterPortConnectCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_port_connect_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB HCD Disconnect Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterPortDisconnectCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_port_disconnect_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB HCD Port Enabled Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterPortEnabledCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_port_enable_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB HCD Port Disabled Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterPortDisabledCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_port_disable_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB HCD Suspend Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterPortSuspendCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_port_suspend_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB HCD Resume Callback
  *         To be used instead of the weak predefined callback.
  * @param  hhcd USB HCD handle
  * @param  p_callback pointer to the Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterPortResumeCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_port_resume_cb = p_callback;

  return HAL_OK;
}


/**
  * @brief  Register USB HCD Host Channel Notify URB (USB Request Block) Change Callback
  *         To be used instead of the weak HAL_HCD_ChannelNotifyURBChangeCallback() predefined callback.
  * @param  hhcd HCD handle
  * @param  p_callback pointer to the USB HCD Host Channel Notify URB Change Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterChannelNotifyURBChangeCallback(hal_hcd_handle_t *hhcd,
                                                            hal_hcd_ch_notify_urb_change_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_ch_notify_urb_change_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB HCD Error Callback
  *         To be used instead of the weak HAL_HCD_ErrorCallback() predefined callback.
  * @param  hhcd HCD handle
  * @param  p_callback pointer to the USB HCD Error Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterErrorCallback(hal_hcd_handle_t *hhcd, hal_hcd_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

