MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB HCD Abort Transfer Callback
  *         To be used instead of the weak HAL_HCD_ChannelAbortTransferCallback() predefined callback.
  * @param  hhcd HCD handle
  * @param  p_callback pointer to the USB HCD Channel Abort Transfer Callback function
  * @retval HAL status
  */
hal_status_t HAL_HCD_RegisterChannelAbortTransferCallback(hal_hcd_handle_t *hhcd, hal_hcd_ch_cb_t p_callback)
{
  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hhcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhcd->p_ch_abort_transfer_cb = p_callback;

  return HAL_OK;
}

#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

/**
  * @}
  */

/**
  * @}
  */
/* Private functions  -----------------------------------------------*/
/** @addtogroup HCD_Private_Functions
  * @{
  */

#if defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1)
/**
  * @brief  Handle Host Channel OUT Double Buffer Bulk requests.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number This parameter can be a value from 1 to 15
  * @param  phy_ch_num Physical Channel number [0..7]
  * @param  reg_value contain Snapshot of the EPCHn register when ISR is detected
  */
static void HCD_DRD_CHANNEL_OUT_BulkDb(hal_hcd_handle_t *hhcd, usb_core_channel_t ch_num,
                                       usb_core_phy_chep_t phy_ch_num, uint32_t reg_value)
{
  const usb_drd_global_t *p_usb;
  uint16_t data_xfr_bytes;
  uint16_t len_bytes;

  /* Check hhcd handler */
  ASSERT_DBG_PARAM((hhcd != NULL));

  /* Check channel number */
  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);

  /* Send Buffer0 */
  if ((reg_value & USB_CH_DTOGTX) != 0U)
  {
    data_xfr_bytes = (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)phy_ch_num)->TXBD & 0x03FF0000U) >> 16U);

    if (hhcd->channel[ch_num].core_ch.xfer_length >= data_xfr_bytes)
    {
      hhcd->channel[ch_num].core_ch.xfer_length -= data_xfr_bytes;
    }
    else
    {
      hhcd->channel[ch_num].core_ch.xfer_length = 0U;
    }

    /* Transfer still in progress: the device ACKed one max-packet-size (MPS) packet, but more data remains. */
    if (hhcd->channel[ch_num].core_ch.xfer_length != 0U)
    {
      /* Manage multiple Xfer */
      hhcd->channel[ch_num].core_ch.xfer_count += data_xfr_bytes;

      /* Check if we need to free user buffer */
      if ((reg_value & USB_CH_DTOGRX) != 0U)
      {
        /* Toggle SwBuff */
        USB_DRD_HCD_CLEAR_TX_DTOG((uint32_t)p_usb, phy_ch_num);
        USB_DRD_HCD_CLEAR_RX_DTOG((uint32_t)p_usb, phy_ch_num);
        USB_DRD_HCD_TX_DTOG((uint32_t)p_usb, phy_ch_num);
      }

      if (hhcd->channel[ch_num].core_ch.xfer_size > 0U) /* Still data to fill in the buffer */
      {
        hhcd->channel[ch_num].core_ch.p_xfer_buffer += data_xfr_bytes;

        /* Calculate Length of new buffer to fill */
        if (hhcd->channel[ch_num].core_ch.xfer_size > hhcd->channel[ch_num].core_ch.max_packet)
        {
          len_bytes = (uint16_t)hhcd->channel[ch_num].core_ch.max_packet;
          hhcd->channel[ch_num].core_ch.xfer_size -= len_bytes;
        }
        else
        {
          len_bytes = (uint16_t)hhcd->channel[ch_num].core_ch.xfer_size;
          hhcd->channel[ch_num].core_ch.xfer_size = 0U; /* end of fill buffer */
        }

        /* Write remaining data to Buffer0 */
        USB_DRD_HCD_SET_CH_DBUF0_CNT((uint32_t)p_usb, phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)len_bytes);
        USB_DRD_WritePMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                         hhcd->channel[ch_num].core_ch.pma_addr0, (uint16_t)len_bytes);
      }
      /* Start a new transfer */
      USB_DRD_HCD_SET_CH_TX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_TX_VALID);
    }
    else
    {
      hhcd->channel[ch_num].core_ch.xfer_count += data_xfr_bytes;
      hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFRC;
      hhcd->channel[ch_num].urb_state  = HAL_HCD_CHANNEL_URB_STATE_DONE;
      hhcd->channel[ch_num].toggle_out ^= 1U;
      /* Close the Channel */
      USB_DRD_HCD_SET_CH_TX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_TX_DIS);
    }
  }
  else
  {
    /* Send Buffer1 */
    data_xfr_bytes = (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)phy_ch_num)->RXBD & 0x03FF0000U) >> 16U);

    if (hhcd->channel[ch_num].core_ch.xfer_length >= data_xfr_bytes)
    {
      hhcd->channel[ch_num].core_ch.xfer_length -= data_xfr_bytes;
    }

    /* Transfer not yet finished only one packet of mps is transferred and ACKed from device */
    if (hhcd->channel[ch_num].core_ch.xfer_length != 0U)
    {
      hhcd->channel[ch_num].core_ch.xfer_count += data_xfr_bytes;

      /* Check if we need to free user buffer */
      if ((reg_value & USB_CH_DTOGRX) == 0U)
      {
        USB_DRD_HCD_CLEAR_TX_DTOG((uint32_t)p_usb, phy_ch_num);
        USB_DRD_HCD_CLEAR_RX_DTOG((uint32_t)p_usb, phy_ch_num);
        USB_DRD_HCD_RX_DTOG((uint32_t)p_usb, phy_ch_num);
      }

      if (hhcd->channel[ch_num].core_ch.xfer_size > 0U) /* Still data to fill in the buffer */
      {
        hhcd->channel[ch_num].core_ch.p_xfer_buffer += data_xfr_bytes;

        /* Calculate length of new buffer to fill */
        if (hhcd->channel[ch_num].core_ch.xfer_size > hhcd->channel[ch_num].core_ch.max_packet)
        {
          len_bytes = hhcd->channel[ch_num].core_ch.max_packet;
          hhcd->channel[ch_num].core_ch.xfer_size -= len_bytes;
        }
        else
        {
          len_bytes = (uint16_t)hhcd->channel[ch_num].core_ch.xfer_size;
          hhcd->channel[ch_num].core_ch.xfer_size = 0U; /* end of fill buffer */
        }

        /* Write remaining data to Buffer1 */
        USB_DRD_HCD_SET_CH_DBUF1_CNT((uint32_t)p_usb, phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)len_bytes);

        USB_DRD_WritePMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                         hhcd->channel[ch_num].core_ch.pma_addr1, (uint16_t)len_bytes);
      }

