MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
      /* Start a new transfer */
      USB_DRD_HCD_SET_CH_TX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_TX_VALID);
    }
    else
    {
      hhcd->channel[ch_num].core_ch.xfer_count += data_xfr_bytes;
      hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFRC;
      hhcd->channel[ch_num].urb_state  = HAL_HCD_CHANNEL_URB_STATE_DONE;
      hhcd->channel[ch_num].toggle_out ^= 1U;

      /* Close the channel */
      USB_DRD_HCD_SET_CH_TX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_TX_DIS);
    }
  }
}


/**
  * @brief  Handle Host Channel IN Double Buffer Bulk requests.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number: This parameter can be a value from 1 to 15
  * @param  phy_ch_num Physical Channel number [0..7]
  * @param  reg_value contain Snapshot of the EPCHn register when ISR is detected
  */
static void HCD_DRD_CHANNEL_IN_BulkDb(hal_hcd_handle_t *hhcd, usb_core_channel_t ch_num,
                                      usb_core_phy_chep_t phy_ch_num, uint32_t reg_value)
{
  const usb_drd_global_t *p_usb;
  uint16_t received_bytes;

  ASSERT_DBG_PARAM((hhcd != NULL));

  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);

  /* Read from Buffer 0 */
  if ((reg_value & USB_CH_DTOGRX) != 0U)
  {
    received_bytes = (uint16_t)USB_DRD_HCD_GET_CH_DBUF0_CNT((uint32_t)p_usb, phy_ch_num);

    if (hhcd->channel[ch_num].core_ch.xfer_length <= received_bytes)
    {
      hhcd->channel[ch_num].core_ch.xfer_length = 0U;
    }
    else
    {
      hhcd->channel[ch_num].core_ch.xfer_length -= received_bytes;
    }

    /* Check if we need to free the other buffer for the IP */
    if ((hhcd->channel[ch_num].core_ch.xfer_length != 0U) && ((reg_value & USB_CH_DTOGTX) != 0U))
    {
      USB_DRD_TX_DTOG((uint32_t)p_usb, phy_ch_num);
    }

    /* Read the data from PMA to user buffer (system memory) */
    USB_DRD_ReadPMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                    hhcd->channel[ch_num].core_ch.pma_addr0, (uint16_t)received_bytes);
  }
  else
  {
    /* Read from Buffer 1 */
    received_bytes = (uint16_t) USB_DRD_HCD_GET_CH_DBUF1_CNT((uint32_t)p_usb, phy_ch_num);

    if (hhcd->channel[ch_num].core_ch.xfer_length <= received_bytes)
    {
      hhcd->channel[ch_num].core_ch.xfer_length = 0U;
    }
    else
    {
      hhcd->channel[ch_num].core_ch.xfer_length -= received_bytes;
    }

    /* Check if we need to free the other buffer for the IP */
    if ((hhcd->channel[ch_num].core_ch.xfer_length != 0U) && ((reg_value & USB_CH_DTOGTX) == 0U))
    {
      USB_DRD_TX_DTOG((uint32_t)p_usb, phy_ch_num);
    }

    /* Read the data from PMA to user buffer (system memory) */
    USB_DRD_ReadPMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                    hhcd->channel[ch_num].core_ch.pma_addr1, (uint16_t)received_bytes);
  }

  /* Update the cumulative byte count for this transfer */
  hhcd->channel[ch_num].core_ch.xfer_count += received_bytes;

  hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_ACK;
  hhcd->channel[ch_num].err_cnt = 0U;

  if ((hhcd->channel[ch_num].core_ch.xfer_length == 0U)
      || ((received_bytes < hhcd->channel[ch_num].core_ch.max_packet)))
  {
    hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_DONE;
    hhcd->channel[ch_num].state  = HAL_HCD_CHANNEL_STATE_XFRC;

    USB_DRD_HCD_SET_CH_RX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_RX_DIS);
  }
  else
  {
    hhcd->channel[ch_num].core_ch.p_xfer_buffer += received_bytes;

    /* Reactivate the channel to submit another URB since the transfer is not yet completed */
    USB_DRD_HCD_SET_CH_RX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_STATRX);
  }
}
#endif /* defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1) */

#if defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1)
/**
  * @brief  Handle Host Channel IN Isochronous Transaction.
  * @param  hhcd HCD handle
  * @param  ch_num Channel number: This parameter can be a value from 1 to 15
  * @param  phy_ch_num Physical Channel number [0..7]
  * @param  reg_value contain Snapshot of the EPCHn register when ISR is detected
  */
static void HCD_DRD_CHANNEL_IN_IsocDb(hal_hcd_handle_t *hhcd, usb_core_channel_t ch_num,
                                      usb_core_phy_chep_t phy_ch_num, uint32_t reg_value)
{
  const usb_drd_global_t *p_usb;

  ASSERT_DBG_PARAM((hhcd != NULL));

  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);

  /* Check if Double buffer isochronous */
  if ((reg_value & USB_CH_EPKIND) != 0U)
  {
    /* Get Data IN Packet */
    hhcd->channel[ch_num].core_ch.xfer_count = USB_DRD_HCD_GET_CH_RX_CNT((uint32_t)p_usb, phy_ch_num);

    if (hhcd->channel[ch_num].core_ch.xfer_count != 0U)
    {
      USB_DRD_ReadPMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                      hhcd->channel[ch_num].core_ch.pma_address,
                      (uint16_t)hhcd->channel[ch_num].core_ch.xfer_count);

      hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_DONE;
    }
  }
#if defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1)
  else  /* double buffer isochronous */
  {
    /* Read from Buffer0 */
    if ((reg_value & USB_CH_DTOGRX) != 0U)
    {
      /* Get number of received bytes in buffer0 */
      hhcd->channel[ch_num].core_ch.xfer_count = USB_DRD_HCD_GET_CH_DBUF0_CNT((uint32_t)p_usb, phy_ch_num);

      if (hhcd->channel[ch_num].core_ch.xfer_count != 0U)
      {
        USB_DRD_ReadPMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                        hhcd->channel[ch_num].core_ch.pma_addr0,
                        (uint16_t)hhcd->channel[ch_num].core_ch.xfer_count);

        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_DONE;
      }
    }
    else
    {
      /* Get number of received bytes in buffer1 */
      hhcd->channel[ch_num].core_ch.xfer_count = USB_DRD_HCD_GET_CH_DBUF1_CNT((uint32_t)p_usb, phy_ch_num);

      if (hhcd->channel[ch_num].core_ch.xfer_count != 0U)
      {
        /* Read from Buffer1 */
        USB_DRD_ReadPMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                        hhcd->channel[ch_num].core_ch.pma_addr1,
                        (uint16_t)hhcd->channel[ch_num].core_ch.xfer_count);

        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_DONE;
      }
    }
  }
#endif /* defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1) */

