MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
  hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFRC;

  /* Clear VTRX */
  USB_DRD_HCD_CLEAR_RX_CH_CTR((uint32_t)p_usb, phy_ch_num);
}
#endif /* defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1) */

/**
  * @brief  Handle Host Channel IN interrupt requests.
  * @param  hhcd HCD handle
  * @param  phy_ch_num Channel number
  *         This parameter can be a value from 1 to 7
  */
static void HCD_DRD_CHANNEL_IN_IRQHandler(hal_hcd_handle_t *hhcd, usb_core_phy_chep_t phy_ch_num)
{
  const usb_drd_global_t *p_usb;
  uint16_t received_bytes;
  usb_core_channel_t ch_num = USB_DRD_GetLogicalChannel(phy_ch_num, USB_CORE_CH_IN_DIR);

  ASSERT_DBG_PARAM((hhcd != NULL));

  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB)
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);

  /* Take a Flag snapshot from the CHEP register, due to STRX bits are used for both control and status */
  uint32_t ch_reg = USB_DRD_HCD_GET_CHANNEL((uint32_t)p_usb, phy_ch_num);

  /* Manage Correct Transaction */
  if ((ch_reg & USB_CH_ERR_RX) == 0U)
  {
    /*
     * Handle non-isochronous endpoints (control/bulk/interrupt) using handshake signaling (ACK/NAK/STALL)
     * Isochronous endpoints: no handshake responses expected (no ACK/NAK/STALL) and no retry
     * Report transaction completion through the isochronous specific path
     */
    if ((ch_reg & USB_CH_UTYPE) != USB_EP_ISOCHRONOUS)
    {
      /* Manage ACK response (single buffer mode) */
      if (((ch_reg) & USB_CH_STATRX) == USB_CH_RX_ACK_SBUF)
      {
        /* Get Control Data OUT Packet */
        received_bytes = (uint16_t)USB_DRD_HCD_GET_CH_RX_CNT((uint32_t)p_usb, phy_ch_num);

        /* Read the data from PMA to user buffer (system memory) */
        USB_DRD_ReadPMA((uint32_t)p_usb, hhcd->channel[ch_num].core_ch.p_xfer_buffer,
                        hhcd->channel[ch_num].core_ch.pma_address, (uint16_t)received_bytes);

        /* Update the cumulative byte count for this transfer */
        hhcd->channel[ch_num].core_ch.xfer_count += received_bytes;

        hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_ACK;
        hhcd->channel[ch_num].err_cnt = 0U;

        if (hhcd->channel[ch_num].core_ch.xfer_length <= received_bytes)
        {
          hhcd->channel[ch_num].core_ch.xfer_length = 0U;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.xfer_length -= received_bytes;
        }

        if ((hhcd->channel[ch_num].core_ch.xfer_length == 0U)
            || ((received_bytes < hhcd->channel[ch_num].core_ch.max_packet)))
        {
          hhcd->channel[ch_num].urb_state  = HAL_HCD_CHANNEL_URB_STATE_DONE;
          hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFRC;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.p_xfer_buffer += received_bytes;

          /* Reactivate the channel to submit another URB since the transfer is not yet completed */
          USB_DRD_HCD_SET_CH_RX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_STATRX);
        }

        if ((hhcd->channel[ch_num].core_ch.ep_type == USB_CORE_EP_TYPE_BULK)
            || (hhcd->channel[ch_num].core_ch.ep_type == USB_CORE_EP_TYPE_INTR))
        {
          hhcd->channel[ch_num].toggle_in ^= 1U;
        }
      }
      else if (((ch_reg & USB_CH_STATRX) == USB_CH_RX_NAK)
               && (hhcd->channel[ch_num].urb_state != HAL_HCD_CHANNEL_URB_STATE_DONE))
      {
        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_NOTREADY;
        hhcd->channel[ch_num].err_cnt = 0U;
        hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_NAK;

        if (hhcd->channel[ch_num].core_ch.ep_type == USB_CORE_EP_TYPE_INTR)
        {
          /* Close the channel */
          USB_DRD_HCD_SET_CH_RX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_RX_DIS);
        }
      }
      else if ((ch_reg & USB_CH_STATRX) == USB_CH_RX_STALL)
      {
        (void)HAL_HCD_HaltChannel(hhcd, (hal_hcd_channel_t)ch_num);
        hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_STALL;
        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_STALL;

        /* Close the channel */
        USB_DRD_HCD_SET_CH_RX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_RX_DIS);
      }
#if defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1)
      /* Double Buffer Management in case of Bulk Transaction */
      else  if (((ch_reg & USB_CH_STATRX) == USB_CH_RX_ACK_DBUF) && ((ch_reg & USB_CH_EPKIND) != 0U))
      {
        /* Bulk IN Double Buffer ISR */
        HCD_DRD_CHANNEL_IN_BulkDb(hhcd, ch_num, phy_ch_num, ch_reg);
      }
#endif /* defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1) */
      else
      {
        /* Nothing to do */
      }

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->p_ch_notify_urb_change_cb(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#else
      HAL_HCD_ChannelNotifyURBChangeCallback(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

      /* Clear VTRX */
      USB_DRD_HCD_CLEAR_RX_CH_CTR((uint32_t)p_usb, phy_ch_num);
    }
#if defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1)
    /* Isochronous Channel */
    else
    {
      HCD_DRD_CHANNEL_IN_IsocDb(hhcd, ch_num, phy_ch_num, ch_reg);
    }
#endif /* defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1) */
  }
  else /* Error detected during last transaction */
  {
    hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_NOTREADY;
    hhcd->channel[ch_num].err_cnt++;
    hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XACTERR;

    /* Clear VTTRX & ERR_RX */
    USB_DRD_HCD_CLEAR_RX_CH_ERR((uint32_t)p_usb, phy_ch_num);

