MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
    /* Disable channel after exceeding the maximum retry count */
    if (hhcd->channel[ch_num].err_cnt > 3U)
    {
      hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_ERROR;
      USB_DRD_HCD_SET_CH_RX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_RX_DIS);

      /* Clear pending err_tx */
      USB_DRD_HCD_CLEAR_RX_CH_ERR((uint32_t)p_usb, phy_ch_num);
    }

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_ch_notify_urb_change_cb(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#else
    HAL_HCD_ChannelNotifyURBChangeCallback(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Handle Host Channel OUT interrupt requests.
  * @param  hhcd  HCD handle
  * @param  phy_ch_num Channel number
  *         This parameter can be a value from 1 to 7
  */
static void HCD_DRD_CHANNEL_OUT_IRQHandler(hal_hcd_handle_t *hhcd, usb_core_phy_chep_t phy_ch_num)
{
  const usb_drd_global_t *p_usb;
  __IO uint32_t get_ch_reg;
  uint16_t data_xfr_bytes;
  usb_core_channel_t ch_num = USB_DRD_GetLogicalChannel(phy_ch_num, USB_CORE_CH_OUT_DIR);

  ASSERT_DBG_PARAM((hhcd != NULL));

  ASSERT_DBG_PARAM(((uint8_t)ch_num < USE_HAL_HCD_MAX_CHANNEL_NB));

  if ((uint8_t)ch_num >= USE_HAL_HCD_MAX_CHANNEL_NB)
  {
    return;
  }

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);

  /* Take a Flag snapshot from the CHEP register, due to STRX bits are used for both control & status */
  uint32_t ch_reg = USB_DRD_HCD_GET_CHANNEL((uint32_t)p_usb, phy_ch_num);

  /*------ Manage Correct Transaction ------*/
  if ((ch_reg & USB_CH_ERR_TX) == 0U)
  {
    /*
     * Handle non-isochronous endpoints (control/bulk/interrupt) using handshake signaling (ACK/NAK/STALL)
     * Isochronous endpoints: no handshake responses expected (no ACK/NAK/STALL) and no retry
     * Report transaction completion through the isochronous specific path
     */
    if ((ch_reg & USB_CH_UTYPE) != USB_EP_ISOCHRONOUS)
    {
      if ((ch_reg & USB_CH_STATTX) == USB_CH_TX_ACK_SBUF)
      {
        data_xfr_bytes = (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)phy_ch_num)->TXBD & 0x03FF0000U) >> 16U);

        if (hhcd->channel[ch_num].core_ch.xfer_length >= data_xfr_bytes)
        {
          hhcd->channel[ch_num].core_ch.xfer_length -= data_xfr_bytes;
        }
        else
        {
          hhcd->channel[ch_num].core_ch.xfer_length = 0U;
        }

        if ((hhcd->channel[ch_num].core_ch.ep_type == USB_CORE_EP_TYPE_BULK)
            || (hhcd->channel[ch_num].core_ch.ep_type == USB_CORE_EP_TYPE_INTR))
        {
          hhcd->channel[ch_num].toggle_out ^= 1U;
        }

        /* Transfer not yet finished: only one MPS packet was transferred and acknowledged by the device */
        if (hhcd->channel[ch_num].core_ch.xfer_length != 0U)
        {
          hhcd->channel[ch_num].core_ch.p_xfer_buffer += data_xfr_bytes;
          hhcd->channel[ch_num].core_ch.xfer_count += data_xfr_bytes;

          /* Start a new transfer */
          (void)hhcd->driver.host_channel_start((uint32_t)p_usb, &hhcd->channel[ch_num].core_ch);
        }
        else
        {
          hhcd->channel[ch_num].core_ch.xfer_count += data_xfr_bytes;
          hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFRC;
          hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_DONE;
        }
      }
      else if (((ch_reg & USB_CHEP_NAK) == USB_CHEP_NAK) || ((ch_reg & USB_CH_STATTX) == USB_CH_TX_NAK))
      {
        hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_NAK;
        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_NOTREADY;
        hhcd->channel[ch_num].err_cnt = 0U;

        get_ch_reg = USB_DRD_HCD_GET_CHANNEL((uint32_t)p_usb, phy_ch_num);

        /* Clear NAK status */
        get_ch_reg &= ~USB_CHEP_NAK & USB_CHEP_REG_MASK;

        USB_DRD_HCD_SET_CHANNEL((uint32_t)p_usb, phy_ch_num, get_ch_reg);

        if (hhcd->channel[ch_num].core_ch.double_buffer_en == 0U)
        {
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
          hhcd->p_ch_notify_urb_change_cb(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#else
          HAL_HCD_ChannelNotifyURBChangeCallback(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
        }
      }
      else if ((ch_reg & USB_CH_STATTX) == USB_CH_TX_STALL)
      {
        (void) HAL_HCD_HaltChannel(hhcd, (hal_hcd_channel_t)ch_num);
        hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_STALL;
        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_STALL;
      }
#if defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1)
      /* Check double buffer ACK in case of bulk transaction */
      else if ((ch_reg & USB_CH_STATTX) == USB_CH_TX_ACK_DBUF)
      {
        /* Double buffer management Bulk Out */
        (void)HCD_DRD_CHANNEL_OUT_BulkDb(hhcd, ch_num, phy_ch_num, ch_reg);
      }
#endif /* defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1) */
      else
      {
        /* Nothing to do */
      }

      if ((ch_reg & USB_CH_STATTX) != USB_CH_TX_NAK)
      {
#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
        hhcd->p_ch_notify_urb_change_cb(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#else
        HAL_HCD_ChannelNotifyURBChangeCallback(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
      }

      USB_DRD_HCD_CLEAR_TX_CH_CTR((uint32_t)p_usb, phy_ch_num);
    }
#if defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1)
    /* Handle Isochronous channel */
    else
    {
      /* Correct transaction */
      if ((p_usb->ISTR & USB_ISTR_ERR) == 0U)
      {
        /* Double buffer isochronous out */
        if ((ch_reg & USB_CH_EPKIND) != 0U)
        {
          USB_DRD_HCD_SET_CH_TX_CNT((uint32_t)p_usb, phy_ch_num, 0U);
        }
#if defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1)
        else /* Double buffer isochronous out */
        {
          /* Odd Transaction */
          if ((ch_reg & USB_CH_DTOGTX) != 0U)
          {
            USB_DRD_HCD_SET_CH_TX_CNT((uint32_t)p_usb, phy_ch_num, 0U);
          }
          /* Even Transaction */
          else
          {
            USB_DRD_HCD_SET_CH_RX_CNT((uint32_t)p_usb, phy_ch_num, 0U);
          }

          USB_DRD_SET_CHEP_TX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_TX_DIS);
        }
#endif /* defined (USE_HAL_HCD_USB_DOUBLE_BUFFER) && (USE_HAL_HCD_USB_DOUBLE_BUFFER == 1) */

