MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hcd.c
        hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XFRC;
        hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_DONE;
      }

      /* Clear Correct Transfer */
      USB_DRD_HCD_CLEAR_TX_CH_CTR((uint32_t)p_usb, phy_ch_num);

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->p_ch_notify_urb_change_cb(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#else
      HAL_HCD_ChannelNotifyURBChangeCallback(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

    }
#endif /* defined (USE_HAL_HCD_USB_EP_TYPE_ISOC) && (USE_HAL_HCD_USB_EP_TYPE_ISOC == 1) */
  }
  /* Manage Transaction Error */
  else
  {
    hhcd->channel[ch_num].err_cnt++;
    if (hhcd->channel[ch_num].err_cnt > 3U)
    {
      USB_DRD_HCD_SET_CH_TX_STATUS((uint32_t)p_usb, phy_ch_num, USB_CH_TX_DIS);
      hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_ERROR;
    }
    else
    {
      hhcd->channel[ch_num].urb_state = HAL_HCD_CHANNEL_URB_STATE_NOTREADY;
    }

    hhcd->channel[ch_num].state = HAL_HCD_CHANNEL_STATE_XACTERR;

    USB_DRD_HCD_CLEAR_TX_CH_ERR((uint32_t)p_usb, phy_ch_num);

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_ch_notify_urb_change_cb(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#else
    HAL_HCD_ChannelNotifyURBChangeCallback(hhcd, (hal_hcd_channel_t)ch_num, hhcd->channel[ch_num].urb_state);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
  }
}


/**
  * @brief  Handle Host Port interrupt requests.
  * @param  hhcd  HCD handle
  */
static void HCD_DRD_Port_IRQHandler(hal_hcd_handle_t *hhcd)
{
  const usb_drd_global_t *p_usb;
  uint32_t fnr_reg;
  uint32_t istr_reg;

  ASSERT_DBG_PARAM((hhcd != NULL));

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hhcd->instance);
  fnr_reg = p_usb->FNR;
  istr_reg = p_usb->ISTR;

  /* SE0 detected USB Disconnected state */
  if ((fnr_reg & (USB_FNR_RXDP | USB_FNR_RXDM)) == 0U)
  {
    hhcd->port_state = HAL_HCD_PORT_STATE_DEV_DISCONNECT;

    /* Clear all allocated virtual channel */
    (void)USB_DRD_ClearPhysicalChannels();

    /* Reset the PMA current pointer */
    (void)USB_DRD_PMAReset();

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
    hhcd->p_port_disconnect_cb(hhcd);
#else
    HAL_HCD_PortDisconnectCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */

    return;
  }

  if (hhcd->port_state == HAL_HCD_PORT_STATE_DEV_DISCONNECT)
  {
    /* J-state or K-state detected & LastState=Disconnected */
    if (((fnr_reg & USB_FNR_RXDP) != 0U) || ((istr_reg & USB_ISTR_LS_DCON) != 0U))
    {
      hhcd->port_state = HAL_HCD_PORT_STATE_DEV_CONNECT;

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->p_port_connect_cb(hhcd);
#else
      HAL_HCD_PortConnectCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* J-state or K-state detected & lastState=Connected: a Missed disconnection is detected */
    if (((fnr_reg & USB_FNR_RXDP) != 0U) || ((istr_reg & USB_ISTR_LS_DCON) != 0U))
    {
      hhcd->port_state = HAL_HCD_PORT_STATE_DEV_DISCONNECT;

      /* Clear all allocated virtual channel */
      (void)USB_DRD_ClearPhysicalChannels();

      /* Reset the PMA current pointer */
      (void)USB_DRD_PMAReset();

#if defined (USE_HAL_HCD_REGISTER_CALLBACKS) && (USE_HAL_HCD_REGISTER_CALLBACKS == 1U)
      hhcd->p_port_disconnect_cb(hhcd);
#else
      HAL_HCD_PortDisconnectCallback(hhcd);
#endif /* USE_HAL_HCD_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @}
  */

/**
  * @}
  */
#endif /* defined (USE_HAL_HCD_MODULE) && (USE_HAL_HCD_MODULE == 1) */
#endif /* defined (USB_DRD_FS) */

/**
  * @}
  */
